Revit 2027 API
ImageExportOptions.FitDirection Property
 The fit direction. Used only if ZoomType is FitToPage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FitDirectionType FitDirection { get; set; }
Public Property FitDirection As FitDirectionType
	Get
	Set
public:
property FitDirectionType FitDirection {
	FitDirectionType get ();
	void set (FitDirectionType value);
}
member FitDirection : FitDirectionType with get, set
Property Value
FitDirectionType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default is Horizontal.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace